package main.java.cipher.matrix;

// Класс для создания стандартных матриц для шифра
public class MatrixFactory {

    // Создает и возвращает стандартную пару кириллических матриц
    public static DoubleSquareMatrix createDefaultCyrillicMatrix() {
        char[][] left = {
                {'Ж', 'Щ', 'Н', 'Ю', 'Р'},
                {'И', 'Т', 'Ь', 'Ц', 'Б'},
                {'Я', 'М', 'Е', '.', 'С'},
                {'В', 'Ы', 'П', 'Ч', ' '},
                {':', 'Д', 'У', 'О', 'К'},
                {'З', 'Э', 'Ф', 'Г', 'Ш'},
                {'Х', 'А', ',', 'Л', 'Ъ'}
        };

        char[][] right = {
                {'И', 'Ч', 'Г', 'Я', 'Т'},
                {',', 'Ж', 'Ь', 'М', 'О'},
                {'З', 'Ю', 'Р', 'В', 'Щ'},
                {'Ц', ':', 'П', 'Е', 'Л'},
                {'Ъ', 'А', 'Н', '.', 'Х'},
                {'Э', 'К', 'С', 'Ш', 'Д'},
                {'Б', 'Ф', 'У', 'Ы', ' '}
        };

        return new DoubleSquareMatrix(left, right);
    }
}